import random
COMMON_NOUNS = [
    "время","человек", "год", "дело","день","рука","раз","город", "слово","место","лицо",
    "друг", "глаз", "вопрос","дом","сторона","страна","мир","случай","голова","ребёнок",
    "сила","конец", "вид", "система", "часть", "работа", "жизнь", "власть", "женщина",
    "дорога", "образ", "отец", "история", "нога", "вода", "война", "любовь", "минута",
    "право", "небо", "сын", "душа", "утро", "вечер", "месяц", "комната", "ночь", "мать",
    "утро", "вещь", "цель", "народ", "сердце", "шаг", "девушка", "машина", "уровень",
    "окно", "ответ", "условие", "начало", "свет", "действие", "век", "школа", "газета",
    "плечо","путь", "дверь", "язык", "любовь", "порядок", "автор", "гость", "закон", "число",
    "идея", "смерть", "сон", "ресурс", "лес", "проблема", "искусство", "река",
    "проект","журнал", "стена", "товарищ", "книга", "письмо", "помощь", "группа", "участие",
]
HANGMANPICS = [
    """
  +---+
  |   |
      |
      |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
      |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
  |   |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|   |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|\\  |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|\\  |
 /    |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|\\  |
 / \\  |
      |
=========""",
]

class bcolors:
    position = "\033[92m"
    letter = "\033[93m"
    endc = "\033[0m" 
    
def main():
    answer = list(random.choice(common_nouns))
    print(answer)
    count = 0

    playfield = []
    for i in answer:
        playfield.append("_")
    while True:
        print(f"В вашем слове {len(answer)} букв")
        print("".join(playfield))
        print(HANGMANPICS[count])

        guess = input("Введите букву: ")

        if len(guess) > 1:
            print("Введите 1 букву")
            continue
        for i in range(len(answer)):
            if guess == answer[i]:
                playfield[i] = guess
        if guess not in answer: 
            count += 1
        if playfield == answer:
            print("Поздравляю! Вы выиграли!") 
            break
        if count == 7:
            print("Упс.. Вас повесили")
            break

    question = input("Хотите ли вы продолжить игру? Да/Нет")
    if question == "Да":
        return main()
    elif question == "Нет":
        print("Благодарим за игру!")
            
main()
